# Imports

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
pd.set_option('display.max_columns', 500)

Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.
Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.

# Construct Dictionary According to Handbook

In [2]:
df = pd.read_csv("alldata.csv")

relevant_species = list(df['Species_name'].value_counts().index[:50]) # Top 50 most prevalent species
attributes = list(df.columns[9:])

def create_species_dict(*absent_phenophases):
    species_dict = dict(zip(attributes, np.zeros(len(attributes), int)))
    for phenophase in absent_phenophases:
        species_dict[phenophase] = 1
    return species_dict

handbook_dicts = {} # Dict mapping species to attribute dicts. 
# Attribute dicts give absent phenophases in the associated species.
# Manually input absent phenophases from SeasonWatch handbook
handbook_dicts[relevant_species[0]] = create_species_dict('Flowers_open','Fruits_open')
handbook_dicts[relevant_species[1]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[2]] = create_species_dict('Flowers_open', 'Fruits_open')
handbook_dicts[relevant_species[3]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[4]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[5]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[6]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[7]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[8]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[9]] = create_species_dict('Flowers_male', 'Flowers_Female')
handbook_dicts[relevant_species[10]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[11]] = create_species_dict('Flowers_male', 'Flowers_Female')
handbook_dicts[relevant_species[12]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[13]] = create_species_dict('Flowers_bud', 'Flowers_open', 'Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[14]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[15]] = create_species_dict('Flowers_male', 'Flowers_Female')
handbook_dicts[relevant_species[16]] = create_species_dict('Flowers_male', 'Flowers_Female')
handbook_dicts[relevant_species[17]] = create_species_dict('Flowers_male', 'Flowers_Female')
handbook_dicts[relevant_species[18]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[19]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[20]] = create_species_dict('Flowers_bud', 'Flowers_open', 'Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[21]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[22]] = create_species_dict('Flowers_male', 'Flowers_Female')
handbook_dicts[relevant_species[23]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[24]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[25]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[26]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[27]] = create_species_dict('Flowers_male', 'Flowers_Female')
handbook_dicts[relevant_species[28]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[29]] = create_species_dict('Flowers_bud', 'Flowers_open', 'Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[30]] = create_species_dict('Flowers_male', 'Flowers_Female')
handbook_dicts[relevant_species[31]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[32]] = create_species_dict('Flowers_male', 'Flowers_Female')
handbook_dicts[relevant_species[33]] = create_species_dict('Flowers_bud', 'Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[34]] = create_species_dict('Flowers_male', 'Flowers_Female')
handbook_dicts[relevant_species[35]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[36]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[37]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[38]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[39]] = create_species_dict('Flowers_male', 'Flowers_Female')
handbook_dicts[relevant_species[40]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[41]] = create_species_dict('Flowers_open', 'Fruits_open')
handbook_dicts[relevant_species[42]] = create_species_dict('Flowers_male', 'Flowers_Female')
handbook_dicts[relevant_species[43]] = create_species_dict('Flowers_male', 'Flowers_Female')
handbook_dicts[relevant_species[44]] = create_species_dict('Flowers_male', 'Flowers_Female')
handbook_dicts[relevant_species[45]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[46]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[47]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[48]] = create_species_dict('Flowers_male', 'Flowers_Female', 'Fruits_open')
handbook_dicts[relevant_species[49]] = create_species_dict('Flowers_male', 'Flowers_Female')

In [3]:
# Relevant Species index to species_name dictionary
dict(zip(range(len(relevant_species)),relevant_species))

{0: 'Jackfruit- Artocarpus heterophyllus',
 1: 'Mango (all varieties)- Mangifera indica',
 2: 'Teak- Tectona grandis',
 3: 'Tamarind- Tamarindus indica',
 4: 'Indian laburnum- Cassia fistula',
 5: 'Amla- Phyllanthus emblica',
 6: 'Jamun- Syzygium cumini',
 7: 'Coconut palm-Cocos nucifera',
 8: 'Neem- Azadirachta indica',
 9: 'Purple bauhinia- Bauhinia purpurea',
 10: 'Maulsari- Mimusops elengi',
 11: 'Gulmohur- Delonix regia',
 12: 'Rain tree-Samanea saman',
 13: 'Peepal- Ficus religiosa',
 14: 'Guava tree-Psidium guajava',
 15: "Devil's tree- Alstonia scholaris",
 16: 'Chandada- Macaranga peltata',
 17: 'True Ashoka- Saraca asoca',
 18: 'Pongam Tree- Pongamia pinnata',
 19: 'Wood Apple- Aegle marmelos',
 20: 'Country Fig- Ficus racemosa',
 21: 'Drumstick tree-Moringa oleifera',
 22: 'Red silk-cotton- Bombax ceiba',
 23: 'Indian Almond- Terminalia catappa',
 24: 'Custard apple-Annona squamosa',
 25: 'Gamar- Gmelina arborea',
 26: 'Copper-pod- Peltophorum pterocarpum',
 27: 'Pride of India- Lagerstroemia speciosa',
 28: 'Chiku- Sapodilla-Manilkara zapota\xa0',
 29: 'Banyan-Ficus benghalensis',
 30: 'Quickstick- Gliricidia sepium',
 31: 'Curry leaf plant-Murraya koenigii',
 32: 'Indian coral tree- Erythrina indica',
 33: 'Mast Tree-Monoon longifolium',
 34: 'Indian Mahogany- Toona ciliata',
 35: 'Fish-tail palm- Caryota urens',
 36: 'Lantana- Lantana camara',
 37: 'Flame of the forest- Butea monosperma',
 38: 'Kadamba-Neolamarckia cadamba',
 39: 'Henna-Lawsonia inermis',
 40: 'Mahua- Madhuca longifolia (var. latifolia)',
 41: 'Toddy palm- Borassus flabellifer',
 42: 'African tulip- Spathodea campanulata',
 43: 'Champa- Michelia champaca',
 44: 'Crepe Jasmine- Tabernaemontana divaricata',
 45: 'Indian elm- Holoptelea integrifolia',
 46: 'Sandalwood- Santalum album',
 47: 'Indian tulip tree- Thespesia populnea',
 48: 'Singapore cherry- Muntingia calabura',
 49: 'Siris- Albizia lebbeck'}

# Reconstruct alldata.csv With New Columns Indicating Incorrect -2 Values

In [4]:
incorrect_negative_2_df = df.copy()
for attribute in attributes:
    incorrect_negative_2_df[f"{attribute}_incorrect_-2"] = np.zeros(incorrect_negative_2_df.shape[0], dtype=int)

for species in relevant_species:
    species_df = df[df['Species_name'] == species]
    species_dict = handbook_dicts[species]
    for attribute in attributes:
        if species_dict[attribute] == 0:
            false_positive_idx = species_df.index[species_df[attribute] == -2] # Indices of reports that incorrectly assign -2 values (false positive) to phenophases that DO appear in the species
            incorrect_negative_2_df.loc[false_positive_idx, f"{attribute}_incorrect_-2"] = np.ones(len(false_positive_idx)) # Label false positive reports as 1 for the phenophase they incorrectly report.
        if species_dict[attribute] == 1:
            false_negative_idx = species_df.index[species_df[attribute] != -2] # Indices of reports that incorrectly assign values other than -2 (false positive) to phenophases that DO NOT appear in the species
            incorrect_negative_2_df.loc[false_negative_idx, f"{attribute}_incorrect_-2"] = 2*np.ones(len(false_negative_idx)) # Label false negative reports as 2 for the phenophase they incorrectly report.

# Preview CSV File

In [5]:
incorrect_negative_2_df

,Unnamed: 0,Observation_ID,Date_of_observation,User_id,User_Tree_id,Species_name,Lat,Long,State_name,Leaves_fresh,Leaves_mature,Leaves_old,Flowers_bud,Flowers_open,Flowers_male,Flowers_Female,Fruits_unripe,Fruits_ripe,Fruits_open,Leaves_fresh_incorrect_-2,Leaves_mature_incorrect_-2,Leaves_old_incorrect_-2,Flowers_bud_incorrect_-2,Flowers_open_incorrect_-2,Flowers_male_incorrect_-2,Flowers_Female_incorrect_-2,Fruits_unripe_incorrect_-2,Fruits_ripe_incorrect_-2,Fruits_open_incorrect_-2
0,1,388564.0,2020-01-01,20396.0,84299.0,Indian Almond- Terminalia catappa,12.15386,75.22397,Kerala,2.0,0.0,0.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,0,0,0,1,1,0,0,1,1,0
1,2,388565.0,2020-01-01,20396.0,84300.0,Indian Almond- Terminalia catappa,12.15386,75.22397,Kerala,2.0,0.0,0.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,0,0,0,1,1,0,0,1,1,0
2,3,388566.0,2020-01-01,20396.0,84301.0,Fish-tail palm- Caryota urens,12.14060,75.22145,Kerala,0.0,2.0,0.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,0,0,0,1,1,0,0,1,1,0
3,4,388567.0,2020-01-01,20396.0,84302.0,Mast Tree-Monoon longifolium,12.14060,75.22145,Kerala,1.0,2.0,0.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,0,0,0,0,1,0,0,1,1,0
4,5,388568.0,2020-01-01,20396.0,84303.0,Indian Almond- Terminalia catappa,12.14060,75.22145,Kerala,0.0,1.0,2.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,-2.0,0,0,0,1,1,0,0,1,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
592588,592589,736977.0,2023-12-04,26471.0,124684.0,Jackfruit- Artocarpus heterophyllus,8.53024,77.04296,Kerala,1.0,2.0,1.0,0.0,-2.0,0.0,0.0,0.0,0.0,-2.0,0,0,0,0,0,0,0,0,0,0
592589,592590,736978.0,2023-12-12,26471.0,124684.0,Jackfruit- Artocarpus heterophyllus,8.53024,77.04296,Kerala,1.0,2.0,1.0,0.0,-2.0,1.0,1.0,0.0,0.0,-2.0,0,0,0,0,0,0,0,0,0,0
592590,592591,736979.0,2023-12-20,26471.0,124684.0,Jackfruit- Artocarpus heterophyllus,8.53024,77.04296,Kerala,1.0,2.0,1.0,1.0,-2.0,1.0,1.0,0.0,0.0,-2.0,0,0,0,0,0,0,0,0,0,0
592591,592592,736981.0,2023-12-28,26471.0,124684.0,Jackfruit- Artocarpus heterophyllus,8.53024,77.04296,Kerala,1.0,2.0,1.0,1.0,-2.0,1.0,1.0,0.0,0.0,-2.0,0,0,0,0,0,0,0,0,0,0
592592,592593,736982.0,2023-12-27,26471.0,124684.0,Jackfruit- Artocarpus heterophyllus,8.53024,77.04296,Kerala,1.0,2.0,1.0,1.0,-2.0,1.0,1.0,0.0,0.0,-2.0,0,0,0,0,0,0,0,0,0,0

# Tests

In [6]:
# For each species, check if reports for each phenophase is marked appropriately in the incorrect_-2 column.
for species in relevant_species:
    print(f'-----------------------------------\n{species}\n-----------------------------------')
    for attribute in attributes:
        a = incorrect_negative_2_df[incorrect_negative_2_df['Species_name'] == species][[attribute, f'{attribute}_incorrect_-2']]
        #display(a[a[attribute] != -2].drop_duplicates())
        display(a.drop_duplicates())

-----------------------------------
Jackfruit- Artocarpus heterophyllus
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
13               1.0                          0
25               0.0                          0
28               2.0                          0
37              -1.0                          0
104179           NaN                          0
179774          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
13                2.0                           0
17                1.0                           0
71                0.0                           0
23370            -1.0                           0
99511             NaN                           0
187390           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
13             1.0                        0
25             0.0                        0
28             NaN                        0
52             2.0                        0
208           -2.0                        1
171855        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
13              1.0                         0
28              0.0                         0
177             2.0                         0
208            -2.0                         1
512            -1.0                         0
103952          NaN                         0

       Flowers_open  Flowers_open_incorrect_-2
13              0.0                          2
17             -2.0                          0
20874           1.0                          2
20952          -1.0                          2
20966           2.0                          2
99511           NaN                          2

     Flowers_male  Flowers_male_incorrect_-2
13            2.0                          0
17            1.0                          0
28            NaN                          0
37            0.0                          0
190          -1.0                          0
208          -2.0                          1

     Flowers_Female  Flowers_Female_incorrect_-2
13              1.0                            0
28              NaN                            0
37              0.0                            0
177             2.0                            0
190            -1.0                            0
208            -2.0                            1

        Fruits_unripe  Fruits_unripe_incorrect_-2
13                2.0                           0
17                1.0                           0
25                0.0                           0
208              -2.0                           1
512              -1.0                           0
104179            NaN                           0

       Fruits_ripe  Fruits_ripe_incorrect_-2
13             1.0                         0
17             0.0                         0
177            2.0                         0
208           -2.0                         1
232           -1.0                         0
99511          NaN                         0

     Fruits_open  Fruits_open_incorrect_-2
13          -2.0                         0
28           NaN                         2
177          0.0                         2

-----------------------------------
Mango (all varieties)- Mangifera indica
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
6                1.0                          0
16               2.0                          0
61               0.0                          0
21519           -1.0                          0
100344           NaN                          0
184412          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
6                 2.0                           0
10                1.0                           0
61                0.0                           0
21519            -1.0                           0
184421           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
6              1.0                        0
7              0.0                        0
86             2.0                        0
205           -2.0                        1
20839          NaN                        0
168076        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
6              -2.0                         1
7               1.0                         0
18              0.0                         0
22              2.0                         0
663            -1.0                         0
104425          NaN                         0

        Flowers_open  Flowers_open_incorrect_-2
6               -2.0                          1
7                0.0                          0
15               1.0                          0
22               2.0                          0
663             -1.0                          0
104058           NaN                          0

        Flowers_male  Flowers_male_incorrect_-2
6               -2.0                          0
164              0.0                          2
20839            NaN                          2
349014           1.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
6                 -2.0                            0
164                0.0                            2
20839              NaN                            2
349014             1.0                            2

       Fruits_unripe  Fruits_unripe_incorrect_-2
6                1.0                           0
7                0.0                           0
10              -2.0                           1
16               2.0                           0
591             -1.0                           0
69276            NaN                           0

       Fruits_ripe  Fruits_ripe_incorrect_-2
6              0.0                         0
10            -2.0                         1
16             1.0                         0
61             2.0                         0
591           -1.0                         0
69276          NaN                         0

       Fruits_open  Fruits_open_incorrect_-2
6             -2.0                         0
164            0.0                         2
20839          NaN                         2

-----------------------------------
Teak- Tectona grandis
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
19               1.0                          0
193              0.0                          0
210              2.0                          0
33193           -1.0                          0
188544          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
19                0.0                           0
66                1.0                           0
192               2.0                           0
23409            -1.0                           0
190251           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
19             NaN                        0
66             1.0                        0
192            0.0                        0
230            2.0                        0
189342        -2.0                        1
191456        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
19              0.0                         0
66              1.0                         0
210             2.0                         0
721            -1.0                         0
184355         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
19               0.0                          2
66               1.0                          2
210              2.0                          2
721             -1.0                          2
185323          -2.0                          0

     Flowers_male  Flowers_male_incorrect_-2
19            NaN                          0
66           -2.0                          1
192           0.0                          0

     Flowers_Female  Flowers_Female_incorrect_-2
19              NaN                            0
66             -2.0                            1
192             0.0                            0

        Fruits_unripe  Fruits_unripe_incorrect_-2
19                0.0                           0
66                1.0                           0
210               2.0                           0
666              -1.0                           0
180401           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
19              0.0                         0
66              1.0                         0
210             2.0                         0
666            -1.0                         0
180401         -2.0                         1

     Fruits_open  Fruits_open_incorrect_-2
19           NaN                         2
66          -2.0                         0
192          0.0                         2

-----------------------------------
Tamarind- Tamarindus indica
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
20               2.0                          0
26               0.0                          0
40               1.0                          0
729             -1.0                          0
192543          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
20                0.0                           0
26                2.0                           0
45                1.0                           0
729              -1.0                           0
99954             NaN                           0
266938           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
20             NaN                        0
26             0.0                        0
32             1.0                        0
59             2.0                        0
729           -1.0                        0
186453        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
20              2.0                         0
26              0.0                         0
45              1.0                         0
381            -1.0                         0
182091         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
20               0.0                          0
45               1.0                          0
59               2.0                          0
381             -1.0                          0
182091          -2.0                          1

     Flowers_male  Flowers_male_incorrect_-2
20            NaN                          2
26           -2.0                          0
165           0.0                          2

     Flowers_Female  Flowers_Female_incorrect_-2
20              NaN                            2
26             -2.0                            0
165             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
20                2.0                           0
26                0.0                           0
60                1.0                           0
729              -1.0                           0
99958             NaN                           0
182091           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
20              2.0                         0
32              1.0                         0
103             0.0                         0
729            -1.0                         0
99954           NaN                         0
182091         -2.0                         1

     Fruits_open  Fruits_open_incorrect_-2
20           NaN                         2
26          -2.0                         0
165          0.0                         2

-----------------------------------
Indian laburnum- Cassia fistula
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
9                1.0                          0
56               0.0                          0
138              2.0                          0
26395           -1.0                          0
193122          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
9                 2.0                           0
51                1.0                           0
96                0.0                           0
26464            -1.0                           0
104108            NaN                           0
192360           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
9              0.0                        0
33             1.0                        0
138            NaN                        0
436            2.0                        0
178361        -2.0                        1
180377        -1.0                        0

     Flowers_bud  Flowers_bud_incorrect_-2
9           -2.0                         1
33           0.0                         0
51           1.0                         0
420          2.0                         0
662         -1.0                         0

     Flowers_open  Flowers_open_incorrect_-2
9            -2.0                          1
33            0.0                          0
51            2.0                          0
56            1.0                          0
662          -1.0                          0

     Flowers_male  Flowers_male_incorrect_-2
9            -2.0                          0
138           NaN                          2
420           0.0                          2

     Flowers_Female  Flowers_Female_incorrect_-2
9              -2.0                            0
138             NaN                            2
420             0.0                            2

     Fruits_unripe  Fruits_unripe_incorrect_-2
9             -2.0                           1
33             0.0                           0
56             1.0                           0
382            2.0                           0
662           -1.0                           0

     Fruits_ripe  Fruits_ripe_incorrect_-2
9           -2.0                         1
33           1.0                         0
51           0.0                         0
157          2.0                         0
662         -1.0                         0

     Fruits_open  Fruits_open_incorrect_-2
9           -2.0                         0
138          NaN                         2
420          0.0                         2

-----------------------------------
Amla- Phyllanthus emblica
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
24               0.0                          0
88               1.0                          0
137              2.0                          0
25404           -1.0                          0
231596          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
24                0.0                           0
88                1.0                           0
137               2.0                           0
26507            -1.0                           0
99960             NaN                           0
231596           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
24             0.0                        0
88             1.0                        0
425            2.0                        0
20834          NaN                        0
186331        -2.0                        1
186715        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
24              0.0                         0
88              1.0                         0
20906          -1.0                         0
21241           2.0                         0
174948         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
24               0.0                          0
88               1.0                          0
20906           -1.0                          0
20940            2.0                          0
99408            NaN                          0
174948          -2.0                          1

       Flowers_male  Flowers_male_incorrect_-2
24             -2.0                          0
425             0.0                          2
20834           NaN                          2

       Flowers_Female  Flowers_Female_incorrect_-2
24               -2.0                            0
425               0.0                            2
20834             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
24                0.0                           0
88                1.0                           0
20834             2.0                           0
20906            -1.0                           0
185001           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
24              0.0                         0
88              1.0                         0
20834          -1.0                         0
20948           2.0                         0
186253         -2.0                         1

       Fruits_open  Fruits_open_incorrect_-2
24            -2.0                         0
425            0.0                         2
20834          NaN                         2

-----------------------------------
Jamun- Syzygium cumini
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
128              1.0                          0
218              2.0                          0
235              0.0                          0
33180           -1.0                          0
260345          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
128               1.0                           0
218               2.0                           0
21381             0.0                           0
28517            -1.0                           0
99905             NaN                           0
224756           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
128            1.0                        0
235            0.0                        0
313            2.0                        0
20851          NaN                        0
158245        -1.0                        0
224756        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
128             1.0                         0
218             0.0                         0
507            -1.0                         0
20851           2.0                         0
178359         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
128              1.0                          0
218              0.0                          0
21988            2.0                          0
37444           -1.0                          0
178359          -2.0                          1

       Flowers_male  Flowers_male_incorrect_-2
128            -2.0                          0
218             0.0                          2
20851           NaN                          2

       Flowers_Female  Flowers_Female_incorrect_-2
128              -2.0                            0
218               0.0                            2
20851             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
128               1.0                           0
218               0.0                           0
20959             2.0                           0
25901            -1.0                           0
183786           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
128             1.0                         0
218             0.0                         0
20945           2.0                         0
32451          -1.0                         0
183786         -2.0                         1

       Fruits_open  Fruits_open_incorrect_-2
128           -2.0                         0
218            0.0                         2
20851          NaN                         2

-----------------------------------
Coconut palm-Cocos nucifera
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
38              -1.0                          0
167              0.0                          0
169              2.0                          0
191              1.0                          0
187675          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
38                2.0                           0
169               0.0                           0
411               1.0                           0
728              -1.0                           0
191385           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
38             0.0                        0
405            1.0                        0
521            2.0                        0
728           -1.0                        0
159059         NaN                        0
187842        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
38             -1.0                         0
167             1.0                         0
169             0.0                         0
592             2.0                         0
103322         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
38              -1.0                          0
167              1.0                          0
169              0.0                          0
415              2.0                          0
182969          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
38              -2.0                          0
167              0.0                          2
159059           NaN                          2

        Flowers_Female  Flowers_Female_incorrect_-2
38                -2.0                            0
167                0.0                            2
159059             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
38               -1.0                           0
167               2.0                           0
169               1.0                           0
681               0.0                           0
103322           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
38              2.0                         0
167             0.0                         0
191             1.0                         0
659            -1.0                         0
184492         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
38             -2.0                         0
167             0.0                         2
159059          NaN                         2

-----------------------------------
Neem- Azadirachta indica
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
152              1.0                          0
223              2.0                          0
348             -1.0                          0
20928            0.0                          0
182517          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
152               2.0                           0
223               1.0                           0
348              -1.0                           0
530               0.0                           0
186130           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
152            1.0                        0
181            0.0                        0
348           -1.0                        0
20928          NaN                        0
162944         2.0                        0
182517        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
152             0.0                         0
348            -1.0                         0
603             1.0                         0
21005           2.0                         0
174949         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
152              0.0                          0
348             -1.0                          0
603              1.0                          0
27161            2.0                          0
174949          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
152             -2.0                          0
223              0.0                          2
20928            NaN                          2
252273         127.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
152               -2.0                            0
223                0.0                            2
20928              NaN                            2
252273           127.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
152               0.0                           0
348              -1.0                           0
530               1.0                           0
27082             2.0                           0
177727           -2.0                           1
252237            NaN                           0

        Fruits_ripe  Fruits_ripe_incorrect_-2
152             0.0                         0
348            -1.0                         0
603             1.0                         0
46840           2.0                         0
182517         -2.0                         1
252237          NaN                         0

       Fruits_open  Fruits_open_incorrect_-2
152           -2.0                         0
223            0.0                         2
20928          NaN                         2

-----------------------------------
Purple bauhinia- Bauhinia purpurea
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
14               1.0                          0
188              0.0                          0
419              2.0                          0
27525           -1.0                          0
170098          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
14                2.0                           0
81                1.0                           0
26713             0.0                           0
37449            -1.0                           0
188027           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
14             1.0                        0
142            NaN                        0
188            0.0                        0
419            2.0                        0
178356        -2.0                        1
190317        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
14              1.0                         0
142             0.0                         0
188             2.0                         0
27524          -1.0                         0
170098         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
14               2.0                          0
81               1.0                          0
142              0.0                          0
39199           -1.0                          0
185052          -2.0                          1

     Flowers_male  Flowers_male_incorrect_-2
14           -2.0                          0
142           NaN                          2
419           0.0                          2

     Flowers_Female  Flowers_Female_incorrect_-2
14             -2.0                            0
142             NaN                            2
419             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
14                1.0                           0
142               0.0                           0
188               2.0                           0
37449            -1.0                           0
170098           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
14              2.0                         0
81              1.0                         0
142             0.0                         0
27710          -1.0                         0
170098         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
14              1.0                         0
142             NaN                         0
188             0.0                         0
419             2.0                         0
178356         -1.0                         0
185247         -2.0                         1

-----------------------------------
Maulsari- Mimusops elengi
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
97               0.0                          0
215              2.0                          0
291              1.0                          0
49243           -1.0                          0
197656          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
97                0.0                           0
215               2.0                           0
292               1.0                           0
34768            -1.0                           0
103742            NaN                           0
200500           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
97             0.0                        0
215            1.0                        0
431            2.0                        0
20850          NaN                        0
230578        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
97              0.0                         0
215             1.0                         0
431             2.0                         0
25439          -1.0                         0
177731         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
97               0.0                          0
215              1.0                          0
431              2.0                          0
25439           -1.0                          0
99541            NaN                          0
190428          -2.0                          1

       Flowers_male  Flowers_male_incorrect_-2
97             -2.0                          0
215             0.0                          2
20850           NaN                          2

       Flowers_Female  Flowers_Female_incorrect_-2
97               -2.0                            0
215               0.0                            2
20850             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
97                1.0                           0
150               0.0                           0
215              -1.0                           0
431               2.0                           0
190428           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
97              1.0                         0
150             0.0                         0
215            -1.0                         0
431             2.0                         0
103742          NaN                         0
191592         -2.0                         1

       Fruits_open  Fruits_open_incorrect_-2
97            -2.0                         0
215            0.0                         2
20850          NaN                         2

-----------------------------------
Gulmohur- Delonix regia
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
35               0.0                          0
446              2.0                          0
604              1.0                          0
23833           -1.0                          0
183524          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
35                2.0                           0
105               0.0                           0
604               1.0                           0
27228            -1.0                           0
194220           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
35             1.0                        0
105            0.0                        0
446            2.0                        0
20847          NaN                        0
188879        -2.0                        1
226162        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
35              0.0                         0
446             1.0                         0
20858           2.0                         0
23833          -1.0                         0
177729         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
35               0.0                          0
446              1.0                          0
21515            2.0                          0
27228           -1.0                          0
185304          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
35              -2.0                          0
446              0.0                          2
20847            NaN                          2
252239         127.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
35                -2.0                            0
446                0.0                            2
20847              NaN                            2
252239           127.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
35                0.0                           0
446               2.0                           0
604               1.0                           0
23833            -1.0                           0
177729           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
35              0.0                         0
446             1.0                         0
629             2.0                         0
27228          -1.0                         0
185198         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
35              0.0                         0
604             1.0                         0
20847           NaN                         0
162898          2.0                         0
181206         -1.0                         0
181368         -2.0                         1

-----------------------------------
Rain tree-Samanea saman
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
8                0.0                          0
158              1.0                          0
22355            2.0                          0
104003           NaN                          0
112043          -1.0                          0
191901          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
8                 2.0                           0
106               0.0                           0
21691             1.0                           0
22355            -1.0                           0
104003            NaN                           0
236958           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
8              0.0                        0
305            1.0                        0
20842          NaN                        0
163275         2.0                        0
188932        -2.0                        1
237948        -1.0                        0

       Flowers_bud  Flowers_bud_incorrect_-2
8             -2.0                         1
106            0.0                         0
438            1.0                         0
22565          2.0                         0
25811         -1.0                         0
69287          NaN                         0

       Flowers_open  Flowers_open_incorrect_-2
8              -2.0                          1
106             0.0                          0
438             1.0                          0
23866           2.0                          0
37406          -1.0                          0
69287           NaN                          0

        Flowers_male  Flowers_male_incorrect_-2
8               -2.0                          0
438              0.0                          2
20842            NaN                          2
252245         127.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
8                 -2.0                            0
438                0.0                            2
20842              NaN                            2
252245           127.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
8                 1.0                           0
163               2.0                           0
305               0.0                           0
23866            -1.0                           0
69287             NaN                           0
180156           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
8               0.0                         0
106             1.0                         0
438             2.0                         0
37406          -1.0                         0
69287           NaN                         0
185442         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
8              -2.0                         0
438             0.0                         2
20842           NaN                         2
252245          1.0                         2

-----------------------------------
Peepal- Ficus religiosa
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
80               1.0                          0
185              2.0                          0
187              0.0                          0
43575           -1.0                          0
186164          -2.0                          1

       Leaves_mature  Leaves_mature_incorrect_-2
80               1.0                           0
187              2.0                           0
403             -2.0                           1
24581            0.0                           0
26490           -1.0                           0

        Leaves_old  Leaves_old_incorrect_-2
80             1.0                        0
185            0.0                        0
429            2.0                        0
20849          NaN                        0
178334        -2.0                        1
232887        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
80              0.0                         2
187            -2.0                         0
20861           1.0                         2
21062           2.0                         2
34652          -1.0                         2
394568          NaN                         2

        Flowers_open  Flowers_open_incorrect_-2
80               0.0                          2
187             -2.0                          0
20861            1.0                          2
22877            2.0                          2
23485           -1.0                          2
394568           NaN                          2

       Flowers_male  Flowers_male_incorrect_-2
80             -2.0                          0
217             0.0                          2
20849           NaN                          2

       Flowers_Female  Flowers_Female_incorrect_-2
80               -2.0                            0
217               0.0                            2
20849             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
80                1.0                           0
185               2.0                           0
187               0.0                           0
217              -1.0                           0
185146           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
80              1.0                         0
185             2.0                         0
187             0.0                         0
217            -1.0                         0
185354         -2.0                         1

       Fruits_open  Fruits_open_incorrect_-2
80            -2.0                         0
217            0.0                         2
20849          NaN                         2

-----------------------------------
Guava tree-Psidium guajava
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
172              2.0                          0
227              1.0                          0
410              0.0                          0
115096          -1.0                          0
185659          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
172               0.0                           0
204               2.0                           0
225               1.0                           0
518              -1.0                           0
191389           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
172            0.0                        0
204            1.0                        0
518            2.0                        0
105896         NaN                        0
185659        -2.0                        1
191278        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
172             2.0                         0
225             0.0                         0
227             1.0                         0
726            -1.0                         0
182717         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
172              2.0                          0
204              1.0                          0
227              0.0                          0
726             -1.0                          0
184269          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
172              0.0                          2
466             -2.0                          0
105896           NaN                          2
208137           1.0                          2
363962           2.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
172                0.0                            2
466               -2.0                            0
105896             NaN                            2
208157             1.0                            2
363962             2.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
172               0.0                           0
204               1.0                           0
257               2.0                           0
726              -1.0                           0
182717           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
172             0.0                         0
257             1.0                         0
410             2.0                         0
726            -1.0                         0
184269         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
172             0.0                         2
466            -2.0                         0
105896          NaN                         2

-----------------------------------
Devil's tree- Alstonia scholaris
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
73               1.0                          0
175              0.0                          0
20856            2.0                          0
27373           -1.0                          0
185390          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
73                1.0                           0
161               2.0                           0
25083             0.0                           0
34745            -1.0                           0
185972           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
73             1.0                        0
161            0.0                        0
20829          NaN                        0
163181         2.0                        0
178137        -2.0                        1
178795        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
73              1.0                         0
161             2.0                         0
303             0.0                         0
30440          -1.0                         0
178061         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
73               1.0                          0
161              2.0                          0
303              0.0                          0
30440           -1.0                          0
185390          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
73              -2.0                          0
20829            NaN                          2
355492           0.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
73                -2.0                            0
20829              NaN                            2
355492             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
73                1.0                           0
161               0.0                           0
20829             2.0                           0
38236            -1.0                           0
178061           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
73              1.0                         0
161             0.0                         0
22135           2.0                         0
38236          -1.0                         0
179659         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
73              1.0                         0
161             0.0                         0
20829           NaN                         0
174750          2.0                         0
179659         -2.0                         1
180349         -1.0                         0

-----------------------------------
Chandada- Macaranga peltata
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
5                0.0                          0
75               1.0                          0
216              2.0                          0
194999          -2.0                          1
514461          -1.0                          0

        Leaves_mature  Leaves_mature_incorrect_-2
5                 2.0                           0
27                1.0                           0
20969             0.0                           0
198150           -2.0                           1
514461           -1.0                           0

        Leaves_old  Leaves_old_incorrect_-2
5              1.0                        0
27             0.0                        0
216            2.0                        0
20833          NaN                        0
186620        -2.0                        1
191716        -1.0                        0

       Flowers_bud  Flowers_bud_incorrect_-2
5             -2.0                         1
27             0.0                         0
75             1.0                         0
430            2.0                         0
21049         -1.0                         0

        Flowers_open  Flowers_open_incorrect_-2
5               -2.0                          1
27               0.0                          0
75               1.0                          0
21049           -1.0                          0
21261            2.0                          0
103745           NaN                          0

       Flowers_male  Flowers_male_incorrect_-2
5              -2.0                          0
216             0.0                          2
20833           NaN                          2

       Flowers_Female  Flowers_Female_incorrect_-2
5                -2.0                            0
216               0.0                            2
20833             NaN                            2

       Fruits_unripe  Fruits_unripe_incorrect_-2
5               -2.0                           1
27               0.0                           0
75               1.0                           0
430              2.0                           0
38313           -1.0                           0

        Fruits_ripe  Fruits_ripe_incorrect_-2
5              -2.0                         1
27              0.0                         0
75              1.0                         0
22623           2.0                         0
78474          -1.0                         0
103745          NaN                         0

        Fruits_open  Fruits_open_incorrect_-2
5              -2.0                         1
27              0.0                         0
75              1.0                         0
20833           NaN                         0
180260         -1.0                         0
200202          2.0                         0

-----------------------------------
True Ashoka- Saraca asoca
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
100              0.0                          0
141              1.0                          0
442              2.0                          0
25943           -1.0                          0
186946          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
100               0.0                           0
141               1.0                           0
170               2.0                           0
28659            -1.0                           0
186242           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
100            0.0                        0
141            NaN                        0
170            1.0                        0
442            2.0                        0
186242        -2.0                        1
252848        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
100             0.0                         0
141             1.0                         0
170             2.0                         0
52083          -1.0                         0
183516         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
100              0.0                          0
141              1.0                          0
170              2.0                          0
25741           -1.0                          0
183516          -2.0                          1

     Flowers_male  Flowers_male_incorrect_-2
100          -2.0                          0
141           NaN                          2
170           0.0                          2

     Flowers_Female  Flowers_Female_incorrect_-2
100            -2.0                            0
141             NaN                            2
170             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
100               0.0                           0
141               1.0                           0
442               2.0                           0
30375            -1.0                           0
183274           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
100             0.0                         0
442             2.0                         0
21128           1.0                         0
25458          -1.0                         0
183516         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
100             0.0                         0
141             NaN                         0
442             2.0                         0
532             1.0                         0
183516         -2.0                         1
186315         -1.0                         0

-----------------------------------
Pongam Tree- Pongamia pinnata
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
104              0.0                          0
182              1.0                          0
443              2.0                          0
93173           -1.0                          0
225315          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
104               0.0                           0
182               2.0                           0
314               1.0                           0
88992            -1.0                           0
104124            NaN                           0
243277           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
104            0.0                        0
182            1.0                        0
20835          NaN                        0
168080        -1.0                        0
171993         2.0                        0
184875        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
104             0.0                         0
21374           2.0                         0
22377           1.0                         0
51036          -1.0                         0
173057         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
104              0.0                          0
21375            1.0                          0
21376            2.0                          0
22378           -1.0                          0
173057          -2.0                          1

       Flowers_male  Flowers_male_incorrect_-2
104            -2.0                          0
354             0.0                          2
20835           NaN                          2

       Flowers_Female  Flowers_Female_incorrect_-2
104              -2.0                            0
354               0.0                            2
20835             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
104               0.0                           0
20835             2.0                           0
20926             1.0                           0
39196            -1.0                           0
173056           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
104             0.0                         0
20835          -1.0                         0
20926           1.0                         0
21110           2.0                         0
173056         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
104            -2.0                         0
354             0.0                         2
20835           NaN                         2
168080         -1.0                         2

-----------------------------------
Wood Apple- Aegle marmelos
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
123              1.0                          0
212              2.0                          0
307              0.0                          0
23743           -1.0                          0
236205          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
123               1.0                           0
212               2.0                           0
21289             0.0                           0
23743            -1.0                           0
236205           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
123            1.0                        0
212            2.0                        0
307            0.0                        0
20933          NaN                        0
178355        -2.0                        1
179773        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
123             1.0                         0
212             2.0                         0
307             0.0                         0
22016          -1.0                         0
184864         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
123              1.0                          0
307              0.0                          0
316              2.0                          0
22016           -1.0                          0
183727          -2.0                          1

       Flowers_male  Flowers_male_incorrect_-2
123            -2.0                          0
212             0.0                          2
20933           NaN                          2

       Flowers_Female  Flowers_Female_incorrect_-2
123              -2.0                            0
212               0.0                            2
20933             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
123               0.0                           0
212               2.0                           0
434               1.0                           0
23743            -1.0                           0
182973           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
123             0.0                         0
212             1.0                         0
22017           2.0                         0
23743          -1.0                         0
185521         -2.0                         1

       Fruits_open  Fruits_open_incorrect_-2
123           -2.0                         0
212            0.0                         2
20933          NaN                         2

-----------------------------------
Country Fig- Ficus racemosa
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
135              0.0                          0
20859            2.0                          0
20881            1.0                          0
37629           -1.0                          0
260393          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
135               0.0                           0
20859             1.0                           0
20860             2.0                           0
22084            -1.0                           0
242856           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
135            0.0                        0
20859          NaN                        0
162292         2.0                        0
162664         1.0                        0
171905        -1.0                        0
186043        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
135            -2.0                         0
20859           1.0                         2
20860           0.0                         2
21189           2.0                         2
34769          -1.0                         2
418907          NaN                         2

        Flowers_open  Flowers_open_incorrect_-2
135             -2.0                          0
20859            1.0                          2
20860            0.0                          2
21209            2.0                          2
39342           -1.0                          2
418907           NaN                          2

        Flowers_male  Flowers_male_incorrect_-2
135             -2.0                          0
20859            NaN                          2
355483           0.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
135               -2.0                            0
20859              NaN                            2
355483             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
135               1.0                           0
20859             0.0                           0
20860             2.0                           0
24047            -1.0                           0
192351           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
135             1.0                         0
20946           0.0                         0
21008           2.0                         0
24047          -1.0                         0
182086         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
135            -2.0                         0
20859           NaN                         2
201300          0.0                         2

-----------------------------------
Drumstick tree-Moringa oleifera
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
166              1.0                          0
174              0.0                          0
524              2.0                          0
180748          -1.0                          0
237105          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
166               2.0                           0
467               1.0                           0
139994            0.0                           0
170341           -1.0                           0
193276           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
166            0.0                        0
174            1.0                        0
139339         NaN                        0
162980         2.0                        0
180748        -1.0                        0
193276        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
166             1.0                         0
174             2.0                         0
467             0.0                         0
657            -1.0                         0
179310         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
166              2.0                          0
467              0.0                          0
657             -1.0                          0
678              1.0                          0
179310          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
166              0.0                          2
174             -2.0                          0
139339           NaN                          2

        Flowers_Female  Flowers_Female_incorrect_-2
166                0.0                            2
174               -2.0                            0
139339             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
166               1.0                           0
174               0.0                           0
587               2.0                           0
657              -1.0                           0
180748           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
166             0.0                         0
471             1.0                         0
657            -1.0                         0
139341          2.0                         0
182786         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
166             0.0                         2
174            -2.0                         0
139339          NaN                         2

-----------------------------------
Red silk-cotton- Bombax ceiba
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
444              2.0                          0
20830            0.0                          0
21152            1.0                          0
111599          -1.0                          0
243943          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
444               1.0                           0
21152             0.0                           0
21320             2.0                           0
41728            -1.0                           0
179813           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
444            0.0                        0
20830          NaN                        0
161588         1.0                        0
163168         2.0                        0
179813        -2.0                        1
197378        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
444             0.0                         0
21152           2.0                         0
21154           1.0                         0
41715          -1.0                         0
179813         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
444              0.0                          0
21158            1.0                          0
22150            2.0                          0
41715           -1.0                          0
179813          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
444              0.0                          2
20830            NaN                          2
161588          -2.0                          0

        Flowers_Female  Flowers_Female_incorrect_-2
444                0.0                            2
20830              NaN                            2
161588            -2.0                            0

        Fruits_unripe  Fruits_unripe_incorrect_-2
444               0.0                           0
22362             1.0                           0
24126             2.0                           0
41714            -1.0                           0
179813           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
444             0.0                         0
22119           1.0                         0
22365           2.0                         0
41716          -1.0                         0
179813         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
444             0.0                         0
20830           NaN                         0
161588          1.0                         0
163224          2.0                         0
179813         -2.0                         1
234933         -1.0                         0

-----------------------------------
Indian Almond- Terminalia catappa
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
0                2.0                          0
4                0.0                          0
11               1.0                          0
191076          -1.0                          0
228765          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
0                 0.0                           0
4                 1.0                           0
11                2.0                           0
251957           -1.0                           0
269471           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
0              0.0                        0
4              2.0                        0
184            1.0                        0
27081          NaN                        0
173063        -2.0                        1
180802        -1.0                        0

       Flowers_bud  Flowers_bud_incorrect_-2
0             -2.0                         1
184            0.0                         0
27081         -1.0                         0
84127          2.0                         0
84770          1.0                         0

       Flowers_open  Flowers_open_incorrect_-2
0              -2.0                          1
184             0.0                          0
27081          -1.0                          0
84127           2.0                          0
85170           1.0                          0

        Flowers_male  Flowers_male_incorrect_-2
0               -2.0                          0
27081            NaN                          2
186981          -1.0                          2
251957           0.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
0                 -2.0                            0
27081              NaN                            2
186981            -1.0                            2
251957             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
0                -2.0                           1
184               2.0                           0
27081             1.0                           0
82903             0.0                           0
235297           -1.0                           0

        Fruits_ripe  Fruits_ripe_incorrect_-2
0              -2.0                         1
184             1.0                         0
82903           0.0                         0
83729           2.0                         0
231108         -1.0                         0

        Fruits_open  Fruits_open_incorrect_-2
0              -2.0                         0
27081           NaN                         2
186981          0.0                         2

-----------------------------------
Custard apple-Annona squamosa
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
224              2.0                          0
228              1.0                          0
782              0.0                          0
185393          -2.0                          1
185657          -1.0                          0

        Leaves_mature  Leaves_mature_incorrect_-2
224               1.0                           0
228               2.0                           0
182050            0.0                           0
185874           -2.0                           1
364287           -1.0                           0

        Leaves_old  Leaves_old_incorrect_-2
224            0.0                        0
228            1.0                        0
162291         2.0                        0
164050         NaN                        0
186595        -2.0                        1
282520        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
224             0.0                         0
643            -1.0                         0
645             1.0                         0
162291          2.0                         0
183753         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
224              0.0                          0
643             -1.0                          0
670              1.0                          0
162291           2.0                          0
183753          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
224              0.0                          2
228             -2.0                          0
164050           NaN                          2
222846           1.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
224                0.0                            2
228               -2.0                            0
164050             NaN                            2
225010             1.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
224               0.0                           0
643               1.0                           0
172901            2.0                           0
180397           -2.0                           1
220256           -1.0                           0

        Fruits_ripe  Fruits_ripe_incorrect_-2
224             0.0                         0
670             1.0                         0
172902          2.0                         0
184383         -2.0                         1
220256         -1.0                         0

        Fruits_open  Fruits_open_incorrect_-2
224             0.0                         2
228            -2.0                         0
164050          NaN                         2

-----------------------------------
Gamar- Gmelina arborea
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
55               0.0                          0
140              1.0                          0
21283            2.0                          0
67562           -1.0                          0
99902            NaN                          0
457243          -2.0                          1

       Leaves_mature  Leaves_mature_incorrect_-2
55               0.0                           0
140              1.0                           0
21227            2.0                           0
67562           -1.0                           0

        Leaves_old  Leaves_old_incorrect_-2
55             0.0                        0
140            NaN                        0
161863         1.0                        0
185415         2.0                        0
241698        -2.0                        1
249744        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
55              0.0                         0
22058           1.0                         0
23958           2.0                         0
47687          -1.0                         0
99902           NaN                         0
185415         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
55               0.0                          0
22058            1.0                          0
24074            2.0                          0
99902            NaN                          0
106461          -1.0                          0
185415          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
55              -2.0                          0
140              NaN                          2
356413           0.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
55                -2.0                            0
140                NaN                            2
356413             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
55                0.0                           0
22366             1.0                           0
24410             2.0                           0
99902             NaN                           0
106462           -1.0                           0
185415           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
55              0.0                         0
22366           1.0                         0
22368           2.0                         0
99902           NaN                         0
106462         -1.0                         0
185415         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
55             -2.0                         0
140             NaN                         2
356413          0.0                         2

-----------------------------------
Copper-pod- Peltophorum pterocarpum
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
73765            2.0                          0
82283            1.0                          0
141391           0.0                          0
200466          -2.0                          1
237040          -1.0                          0

        Leaves_mature  Leaves_mature_incorrect_-2
73765             2.0                           0
111601            1.0                           0
147559            0.0                           0
200466           -2.0                           1
242244           -1.0                           0

        Leaves_old  Leaves_old_incorrect_-2
73765          NaN                        0
168074         1.0                        0
176380         2.0                        0
181312         0.0                        0
182101        -2.0                        1
242176        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
73765           1.0                         0
82283           0.0                         0
88655           2.0                         0
143999         -1.0                         0
182967         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
73765            2.0                          0
82283            0.0                          0
120833           1.0                          0
182967          -2.0                          1
404260          -1.0                          0

        Flowers_male  Flowers_male_incorrect_-2
73765            NaN                          2
168074          -2.0                          0
356448           0.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
73765              NaN                            2
168074            -2.0                            0
356448             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
73765             0.0                           0
88655            -1.0                           0
147859            1.0                           0
149518            2.0                           0
184901           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
73765           0.0                         0
88655          -1.0                         0
111601          2.0                         0
145121          1.0                         0
186428         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
73765           NaN                         2
168074         -2.0                         0
201493          0.0                         2

-----------------------------------
Pride of India- Lagerstroemia speciosa
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
99               0.0                          0
350              1.0                          0
20862            2.0                          0
67561           -1.0                          0
185806          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
99                0.0                           0
156               1.0                           0
306               2.0                           0
67561            -1.0                           0
270148           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
99             0.0                        0
156            1.0                        0
350            2.0                        0
20832          NaN                        0
196377        -2.0                        1
250781        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
99              0.0                         0
350             1.0                         0
22616           2.0                         0
28545          -1.0                         0
185806         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
99               0.0                          0
350              2.0                          0
20832            1.0                          0
45211           -1.0                          0
185806          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
99              -2.0                          0
20832            NaN                          2
356415           0.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
99                -2.0                            0
20832              NaN                            2
356415             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
99                0.0                           0
308               1.0                           0
22340             2.0                           0
50064            -1.0                           0
184934           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
99              0.0                         0
306             2.0                         0
22359           1.0                         0
50509          -1.0                         0
185161         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
99              0.0                         0
306             1.0                         0
383             2.0                         0
20832           NaN                         0
181212         -2.0                         1
200414         -1.0                         0

-----------------------------------
Chiku- Sapodilla-Manilkara zapotaÂ
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
21               1.0                          0
221              2.0                          0
164147           0.0                          0
369889          -1.0                          0

        Leaves_mature  Leaves_mature_incorrect_-2
21                1.0                           0
409               2.0                           0
198554            0.0                           0
198989           -2.0                           1
241055           -1.0                           0

        Leaves_old  Leaves_old_incorrect_-2
21             0.0                        0
221            1.0                        0
658            2.0                        0
163874         NaN                        0
186623        -2.0                        1
202928        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
21              0.0                         0
221             1.0                         0
523             2.0                         0
658            -1.0                         0
184352         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
21               0.0                          0
221              1.0                          0
658             -1.0                          0
159945           2.0                          0
184762          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
21              -2.0                          0
221              0.0                          2
163874           NaN                          2
208151           1.0                          2
222841           2.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
21                -2.0                            0
221                0.0                            2
163874             NaN                            2
222840             1.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
21                0.0                           0
221               1.0                           0
479               2.0                           0
184352           -2.0                           1
205770           -1.0                           0

        Fruits_ripe  Fruits_ripe_incorrect_-2
21              0.0                         0
409             1.0                         0
176524          2.0                         0
185318         -2.0                         1
205770         -1.0                         0

        Fruits_open  Fruits_open_incorrect_-2
21             -2.0                         0
221             0.0                         2
163874          NaN                         2

-----------------------------------
Banyan-Ficus benghalensis
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
159              1.0                          0
380              2.0                          0
20981            0.0                          0
169066          -1.0                          0
186337          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
159               2.0                           0
21887             0.0                           0
25440             1.0                           0
184807           -1.0                           0
194083           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
159            0.0                        0
20981          NaN                        0
162916         2.0                        0
178329        -2.0                        1
182510         1.0                        0
192718        -1.0                        0

       Flowers_bud  Flowers_bud_incorrect_-2
159           -2.0                         0
647            0.0                         2
20981         -1.0                         2
25440          1.0                         2
32012          2.0                         2

       Flowers_open  Flowers_open_incorrect_-2
159            -2.0                          0
647             0.0                          2
20981          -1.0                          2
28013           1.0                          2
58064           2.0                          2

       Flowers_male  Flowers_male_incorrect_-2
159            -2.0                          0
647             0.0                          2
20981           NaN                          2

       Flowers_Female  Flowers_Female_incorrect_-2
159              -2.0                            0
647               0.0                            2
20981             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
159               2.0                           0
196               0.0                           0
20981            -1.0                           0
26785             1.0                           0
185149           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
159             2.0                         0
196             0.0                         0
20981          -1.0                         0
21889           1.0                         0
185149         -2.0                         1

       Fruits_open  Fruits_open_incorrect_-2
159           -2.0                         0
647            0.0                         2
20981          NaN                         2

-----------------------------------
Quickstick- Gliricidia sepium
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
162              0.0                          0
492              1.0                          0
183385           2.0                          0
191050          -1.0                          0
191103          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
162               2.0                           0
184521            1.0                           0
189451            0.0                           0
197842           -2.0                           1
298640           -1.0                           0

        Leaves_old  Leaves_old_incorrect_-2
162            1.0                        0
184521         0.0                        0
187016         2.0                        0
191103        -2.0                        1
219921         NaN                        0

        Flowers_bud  Flowers_bud_incorrect_-2
162             2.0                         0
492             1.0                         0
183385          0.0                         0
185647         -2.0                         1
190229         -1.0                         0

        Flowers_open  Flowers_open_incorrect_-2
162              2.0                          0
492              0.0                          0
184521           1.0                          0
185647          -2.0                          1
192304          -1.0                          0

        Flowers_male  Flowers_male_incorrect_-2
162             -2.0                          0
492              0.0                          2
219921           NaN                          2

        Flowers_Female  Flowers_Female_incorrect_-2
162               -2.0                            0
492                0.0                            2
219921             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
162               0.0                           0
184521           -2.0                           1
185505            1.0                           0
189863            2.0                           0
192304           -1.0                           0

        Fruits_ripe  Fruits_ripe_incorrect_-2
162             0.0                         0
184521         -1.0                         0
185647         -2.0                         1
197557          1.0                         0
198376          2.0                         0

        Fruits_open  Fruits_open_incorrect_-2
162             0.0                         0
184521         -1.0                         0
185647         -2.0                         1
191508          1.0                         0
200194          2.0                         0
219921          NaN                         0

-----------------------------------
Curry leaf plant-Murraya koenigii
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
200              1.0                          0
386              2.0                          0
691             -1.0                          0
706              0.0                          0
191661          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
200               2.0                           0
386               1.0                           0
691              -1.0                           0
185226            0.0                           0
271956           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
200            1.0                        0
691           -1.0                        0
706            0.0                        0
733            2.0                        0
173377         NaN                        0
193657        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
200             0.0                         0
613             1.0                         0
665            -1.0                         0
162966          2.0                         0
182445         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
200              0.0                          0
386              2.0                          0
613              1.0                          0
665             -1.0                          0
182445          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
200             -2.0                          0
386              0.0                          2
173377           NaN                          2

        Flowers_Female  Flowers_Female_incorrect_-2
200               -2.0                            0
386                0.0                            2
173377             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
200               0.0                           0
613               1.0                           0
665              -1.0                           0
162964            2.0                           0
182445           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
200             0.0                         0
613             1.0                         0
665            -1.0                         0
162964          2.0                         0
182445         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
200            -2.0                         0
386             0.0                         2
173377          NaN                         2

-----------------------------------
Indian coral tree- Erythrina indica
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
76               2.0                          0
129              1.0                          0
298              0.0                          0
225435          -1.0                          0
237171          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
76                1.0                           0
213               2.0                           0
21183             0.0                           0
234870           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
76             1.0                        0
298            0.0                        0
426            2.0                        0
20848          NaN                        0
228805        -2.0                        1
546257        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
76              1.0                         0
146             0.0                         0
22590           2.0                         0
111172         -1.0                         0
237171         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
76               1.0                          0
146              0.0                          0
22591            2.0                          0
79924           -1.0                          0
237171          -2.0                          1

       Flowers_male  Flowers_male_incorrect_-2
76             -2.0                          0
213             0.0                          2
20848           NaN                          2

       Flowers_Female  Flowers_Female_incorrect_-2
76               -2.0                            0
213               0.0                            2
20848             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
76                1.0                           0
146               0.0                           0
213              -1.0                           0
426               2.0                           0
190547           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
76              1.0                         0
146             0.0                         0
213            -1.0                         0
426             2.0                         0
228805         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
76              1.0                         0
146             0.0                         0
213            -1.0                         0
426             2.0                         0
20848           NaN                         0
228805         -2.0                         1

-----------------------------------
Mast Tree-Monoon longifolium
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
3                1.0                          0
21794            2.0                          0
30085            0.0                          0
93178           -1.0                          0
260195          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
3                 2.0                           0
46839             0.0                           0
47071             1.0                           0
260195           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
3              0.0                        0
21794          NaN                        0
160463         1.0                        0
196364        -2.0                        1
201521         2.0                        0
577644        -1.0                        0

       Flowers_bud  Flowers_bud_incorrect_-2
3             -2.0                         0
21794          0.0                         2
28487          2.0                         2
38368          1.0                         2
53542         -1.0                         2

       Flowers_open  Flowers_open_incorrect_-2
3              -2.0                          1
21794           0.0                          0
28487           2.0                          0
46915           1.0                          0
53568          -1.0                          0

        Flowers_male  Flowers_male_incorrect_-2
3               -2.0                          0
21794            NaN                          2
181343           0.0                          2
203166           1.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
3                 -2.0                            0
21794              NaN                            2
181343             0.0                            2
203166             1.0                            2

       Fruits_unripe  Fruits_unripe_incorrect_-2
3               -2.0                           1
21794            0.0                           0
28487            2.0                           0
46839            1.0                           0
47683           -1.0                           0

       Fruits_ripe  Fruits_ripe_incorrect_-2
3             -2.0                         1
21794          0.0                         0
28487          2.0                         0
47071          1.0                         0
47683         -1.0                         0

        Fruits_open  Fruits_open_incorrect_-2
3              -2.0                         0
21794           NaN                         2
201509          0.0                         2

-----------------------------------
Indian Mahogany- Toona ciliata
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
44               1.0                          0
49               0.0                          0
478              2.0                          0
78467           -1.0                          0
305638          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
44                2.0                           0
78467            -1.0                           0
104972            1.0                           0
105696            0.0                           0
280719           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
44             0.0                        0
49             1.0                        0
653            2.0                        0
73961          NaN                        0
185993        -2.0                        1
237253        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
44              0.0                         0
653            -1.0                         0
73961           1.0                         0
73962           2.0                         0
184567         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
44               0.0                          0
653             -1.0                          0
73962            1.0                          0
117274           2.0                          0
184567          -2.0                          1

       Flowers_male  Flowers_male_incorrect_-2
44             -2.0                          0
478             0.0                          2
73961           NaN                          2

       Flowers_Female  Flowers_Female_incorrect_-2
44               -2.0                            0
478               0.0                            2
73961             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
44                0.0                           0
653              -1.0                           0
112711            2.0                           0
117274            1.0                           0
184567           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
44              0.0                         0
49              1.0                         0
653            -1.0                         0
136046          2.0                         0
184567         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
44              0.0                         0
653            -1.0                         0
73961           NaN                         0
184567         -2.0                         1
185425          1.0                         0
187615          2.0                         0

-----------------------------------
Fish-tail palm- Caryota urens
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
2                0.0                          0
486              1.0                          0
168542           2.0                          0
186785          -1.0                          0
254508          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
2                 2.0                           0
183660            1.0                           0
190418            0.0                           0
254508           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
2              0.0                        0
486            1.0                        0
111299         NaN                        0
186785        -1.0                        0
186974         2.0                        0
187362        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
2              -2.0                         1
486             0.0                         0
497             1.0                         0
150223          2.0                         0
184476         -1.0                         0

        Flowers_open  Flowers_open_incorrect_-2
2               -2.0                          1
486              0.0                          0
172274           1.0                          0
173314           2.0                          0
239308          -1.0                          0

        Flowers_male  Flowers_male_incorrect_-2
2               -2.0                          0
486              0.0                          2
111299           NaN                          2

        Flowers_Female  Flowers_Female_incorrect_-2
2                 -2.0                            0
486                0.0                            2
111299             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
2                -2.0                           1
486               0.0                           0
111299            2.0                           0
150223           -1.0                           0
151772            1.0                           0

        Fruits_ripe  Fruits_ripe_incorrect_-2
2              -2.0                         1
486             1.0                         0
111299         -1.0                         0
149980          0.0                         0
150026          2.0                         0

        Fruits_open  Fruits_open_incorrect_-2
2              -2.0                         0
486             0.0                         2
111299          NaN                         2

-----------------------------------
Lantana- Lantana camara
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
667              2.0                          0
780              1.0                          0
86113            0.0                          0
178360          -1.0                          0
188881          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
667               1.0                           0
780               2.0                           0
150595            0.0                           0
197546           -1.0                           0
199245           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
667            0.0                        0
780            1.0                        0
86113          NaN                        0
178360        -2.0                        1
186918         2.0                        0
236020        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
667             2.0                         0
780             1.0                         0
86113           0.0                         0
144431         -1.0                         0
170097         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
667              2.0                          0
86113            1.0                          0
144431          -1.0                          0
163416           0.0                          0
170097          -2.0                          1

       Flowers_male  Flowers_male_incorrect_-2
667             0.0                          2
780            -2.0                          0
86113           NaN                          2

       Flowers_Female  Flowers_Female_incorrect_-2
667               0.0                            2
780              -2.0                            0
86113             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
667              -1.0                           0
780               1.0                           0
110924            0.0                           0
149239            2.0                           0
170097           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
667            -1.0                         0
780             1.0                         0
86113           0.0                         0
150595          2.0                         0
170097         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
667             0.0                         2
780            -2.0                         0
86113           NaN                         2
201368          2.0                         2

-----------------------------------
Flame of the forest- Butea monosperma
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
48               2.0                          0
21785            1.0                          0
67817            0.0                          0
172092          -1.0                          0
234938          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
48                2.0                           0
71066             1.0                           0
150521            0.0                           0
192359           -2.0                           1
242447           -1.0                           0

        Leaves_old  Leaves_old_incorrect_-2
48             1.0                        0
21785          NaN                        0
172092         0.0                        0
182971         2.0                        0
185411        -2.0                        1
187517        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
48              1.0                         0
21785           0.0                         0
58732           2.0                         0
182093         -2.0                         1
188557         -1.0                         0

        Flowers_open  Flowers_open_incorrect_-2
48               1.0                          0
21785            0.0                          0
58732            2.0                          0
185411          -2.0                          1
188557          -1.0                          0

        Flowers_male  Flowers_male_incorrect_-2
48              -2.0                          0
21785            NaN                          2
357193           0.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
48                -2.0                            0
21785              NaN                            2
357193             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
48                0.0                           0
46649             1.0                           0
69245             2.0                           0
172092           -2.0                           1
187517           -1.0                           0

        Fruits_ripe  Fruits_ripe_incorrect_-2
48              0.0                         0
46649           1.0                         0
70383           2.0                         0
182093         -2.0                         1
187517         -1.0                         0

        Fruits_open  Fruits_open_incorrect_-2
48             -2.0                         0
21785           NaN                         2
357193          0.0                         2

-----------------------------------
Kadamba-Neolamarckia cadamba
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
21369            0.0                          0
21712            2.0                          0
25306            1.0                          0
261390          -1.0                          0
302676          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
21369             2.0                           0
22082             0.0                           0
23995             1.0                           0
40113            -1.0                           0
268385           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
21369          NaN                        0
176685         1.0                        0
179775         2.0                        0
189173         0.0                        0
261390        -1.0                        0
268609        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
21369           0.0                         0
24705          -1.0                         0
26697           1.0                         0
27058           2.0                         0
185751         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
21369            0.0                          0
21712            1.0                          0
24705           -1.0                          0
27803            2.0                          0
261390          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
21369            NaN                          2
176685          -2.0                          0
356595           0.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
21369              NaN                            2
176685            -2.0                            0
356595             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
21369             0.0                           0
21712             2.0                           0
27876             1.0                           0
40116            -1.0                           0
180998           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
21369           0.0                         0
21712           2.0                         0
33531           1.0                         0
50436          -1.0                         0
185751         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
21369           NaN                         2
176685          0.0                         2
183316          2.0                         2
185245          1.0                         2
185630         -1.0                         2
185751         -2.0                         0

-----------------------------------
Henna-Lawsonia inermis
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
656              2.0                          0
677              1.0                          0
178648           0.0                          0
196989          -2.0                          1
420789          -1.0                          0

        Leaves_mature  Leaves_mature_incorrect_-2
656               1.0                           0
723               2.0                           0
185860            0.0                           0
270178           -2.0                           1
420789           -1.0                           0

        Leaves_old  Leaves_old_incorrect_-2
656            1.0                        0
178648         NaN                        0
181370         0.0                        0
186371         2.0                        0
188046        -2.0                        1
249555        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
656            -1.0                         0
677             1.0                         0
180064          0.0                         0
181943          2.0                         0
186448         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
656             -1.0                          0
677              1.0                          0
178649           0.0                          0
181943           2.0                          0
186448          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
656             -2.0                          0
677              0.0                          2
178648           NaN                          2

        Flowers_Female  Flowers_Female_incorrect_-2
656               -2.0                            0
677                0.0                            2
178648             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
656               0.0                           0
723              -1.0                           0
160285            1.0                           0
184327            2.0                           0
186448           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
656             0.0                         0
723            -1.0                         0
160285          1.0                         0
186448         -2.0                         1
188303          2.0                         0

        Fruits_open  Fruits_open_incorrect_-2
656            -2.0                         1
677             0.0                         0
178648          NaN                         0

-----------------------------------
Mahua- Madhuca longifolia (var. latifolia)
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
639              0.0                          0
21751            2.0                          0
23560            1.0                          0
236700          -1.0                          0
303422          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
639               0.0                           0
21356             2.0                           0
21751             1.0                           0
275843           -2.0                           1
407767           -1.0                           0

        Leaves_old  Leaves_old_incorrect_-2
639            0.0                        0
21356          NaN                        0
180078         1.0                        0
195402        -2.0                        1
202620         2.0                        0
215626        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
639             0.0                         0
21751           2.0                         0
21752           1.0                         0
140976         -1.0                         0
184655         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
639              0.0                          0
21751            1.0                          0
23821            2.0                          0
140870          -1.0                          0
239620          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
639              0.0                          2
21356            NaN                          2
180078          -2.0                          0

        Flowers_Female  Flowers_Female_incorrect_-2
639                0.0                            2
21356              NaN                            2
180078            -2.0                            0

        Fruits_unripe  Fruits_unripe_incorrect_-2
639               0.0                           0
24428             2.0                           0
25272             1.0                           0
140870           -1.0                           0
195379           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
639             0.0                         0
25271           1.0                         0
25272           2.0                         0
150523         -1.0                         0
239620         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
639             0.0                         2
21356           NaN                         2
180078         -2.0                         0

-----------------------------------
Toddy palm- Borassus flabellifer
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
68277            2.0                          0
85033            1.0                          0
144444          -1.0                          0
180278           0.0                          0
193006          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
68277             2.0                           0
106060           -1.0                           0
109377            1.0                           0
117687            0.0                           0
302690           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
68277          NaN                        0
160461         1.0                        0
162951         2.0                        0
185312         0.0                        0
186012        -2.0                        1
276929        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
68277           2.0                         0
85033           0.0                         0
87953           1.0                         0
134817         -1.0                         0
184219         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
68277            2.0                          2
85033            0.0                          2
88493            1.0                          2
134817          -1.0                          2
162951          -2.0                          0

        Flowers_male  Flowers_male_incorrect_-2
68277            NaN                          0
160461           1.0                          0
162951           2.0                          0
180278           0.0                          0
184219          -2.0                          1
187431          -1.0                          0

        Flowers_Female  Flowers_Female_incorrect_-2
68277              NaN                            0
160461             1.0                            0
162951             2.0                            0
180278            -1.0                            0
184219            -2.0                            1
184636             0.0                            0

        Fruits_unripe  Fruits_unripe_incorrect_-2
68277             1.0                           0
85033             0.0                           0
92543             2.0                           0
109395           -1.0                           0
184219           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
68277           2.0                         0
85428           1.0                         0
87953           0.0                         0
134817         -1.0                         0
185312         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
68277           NaN                         2
160461         -2.0                         0
355434          0.0                         2

-----------------------------------
African tulip- Spathodea campanulata
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
757              1.0                          0
105205           0.0                          0
117910           2.0                          0
139582          -1.0                          0
185316          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
757               2.0                           0
129935            1.0                           0
139582           -1.0                           0
238706            0.0                           0
263396           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
757            1.0                        0
88653          NaN                        0
168069         0.0                        0
171162        -2.0                        1
185298         2.0                        0
194964        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
757             1.0                         0
88653           2.0                         0
105205          0.0                         0
139582         -1.0                         0
171162         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
757              2.0                          0
105205           1.0                          0
105776           0.0                          0
139582          -1.0                          0
185793          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
757             -2.0                          0
88653            NaN                          2
251945          -1.0                          2
356464           0.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
757               -2.0                            0
88653              NaN                            2
251945            -1.0                            2
356464             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
757               0.0                           0
88653             2.0                           0
105205            1.0                           0
112220           -1.0                           0
168069           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
757             0.0                         0
88653           1.0                         0
105205          2.0                         0
112220         -1.0                         0
168069         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
757             1.0                         0
88653           NaN                         0
168069         -2.0                         1
180963          0.0                         0
191999         -1.0                         0
201540          2.0                         0

-----------------------------------
Champa- Michelia champaca
-----------------------------------

       Leaves_fresh  Leaves_fresh_incorrect_-2
751             1.0                          0
41913           2.0                          0
68573           0.0                          0

        Leaves_mature  Leaves_mature_incorrect_-2
751               2.0                           0
41913             1.0                           0
151245            0.0                           0
360618           -1.0                           0
546227           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
751            0.0                        0
821            1.0                        0
41913          NaN                        0
162883         2.0                        0
171846        -1.0                        0
196358        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
751             1.0                         0
821             2.0                         0
68063           0.0                         0
120852         -1.0                         0
182965         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
751              1.0                          0
41913            0.0                          0
64234            2.0                          0
185776          -2.0                          1
188427          -1.0                          0

       Flowers_male  Flowers_male_incorrect_-2
751            -2.0                          0
821             0.0                          2
41913           NaN                          2

       Flowers_Female  Flowers_Female_incorrect_-2
751              -2.0                            0
821               0.0                            2
41913             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
751               0.0                           0
64234             2.0                           0
71029             1.0                           0
82925            -1.0                           0
182965           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
751             0.0                         0
64234           2.0                         0
80132           1.0                         0
84214          -1.0                         0
184783         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
751             0.0                         0
41913           NaN                         0
162883          2.0                         0
168623          1.0                         0
171846         -1.0                         0
184783         -2.0                         1

-----------------------------------
Crepe Jasmine- Tabernaemontana divaricata
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
655              1.0                          0
154808           2.0                          0
170927           0.0                          0
296387          -2.0                          1
476898          -1.0                          0

        Leaves_mature  Leaves_mature_incorrect_-2
655               1.0                           0
149908            2.0                           0
191620            0.0                           0
296387           -2.0                           1
587900           -1.0                           0

        Leaves_old  Leaves_old_incorrect_-2
655            0.0                        0
149908         NaN                        0
183496         1.0                        0
184262         2.0                        0
186602        -2.0                        1
414984        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
655             1.0                         0
150222          2.0                         0
163495          0.0                         0
189858         -2.0                         1
219476         -1.0                         0

        Flowers_open  Flowers_open_incorrect_-2
655              0.0                          0
149908           1.0                          0
150222           2.0                          0
189858          -2.0                          1
219476          -1.0                          0

        Flowers_male  Flowers_male_incorrect_-2
655             -2.0                          0
149908           NaN                          2
356286           0.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
655               -2.0                            0
149908             NaN                            2
356286             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
655               0.0                           0
178489            2.0                           0
178641            1.0                           0
185181           -2.0                           1
212070           -1.0                           0

        Fruits_ripe  Fruits_ripe_incorrect_-2
655             0.0                         0
174401          1.0                         0
178489          2.0                         0
185181         -2.0                         1
200625         -1.0                         0

        Fruits_open  Fruits_open_incorrect_-2
655            -2.0                         1
149908          NaN                         0
356286          0.0                         0
510582         -1.0                         0
524734          2.0                         0
547086          1.0                         0

-----------------------------------
Indian elm- Holoptelea integrifolia
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
98               0.0                          0
830              1.0                          0
24275            2.0                          0
244265          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
98                0.0                           0
830               2.0                           0
20886             1.0                           0
139397           -1.0                           0
249470           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
98             0.0                        0
830            1.0                        0
20886          NaN                        0
186617        -2.0                        1
186770         2.0                        0
186885        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
98              1.0                         0
830             0.0                         0
21256           2.0                         0
78559          -1.0                         0
186611         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
98               1.0                          0
830              0.0                          0
22609            2.0                          0
78559           -1.0                          0
186876          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
98               1.0                          2
830              0.0                          2
20886            NaN                          2
186876          -2.0                          0
187635          -1.0                          2
194645           2.0                          2

       Flowers_Female  Flowers_Female_incorrect_-2
98               -2.0                            0
830               0.0                            2
20886             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
98                1.0                           0
830               0.0                           0
22611             2.0                           0
78559            -1.0                           0
186876           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
98              1.0                         0
830             0.0                         0
23972           2.0                         0
78559          -1.0                         0
186876         -2.0                         1

       Fruits_open  Fruits_open_incorrect_-2
98            -2.0                         0
830            0.0                         2
20886          NaN                         2

-----------------------------------
Sandalwood- Santalum album
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
389              2.0                          0
82601            1.0                          0
105039           0.0                          0
109081          -1.0                          0
266011          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
389               2.0                           0
109081           -1.0                           0
140283            1.0                           0
140464            0.0                           0
266869           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
389            0.0                        0
82601          NaN                        0
154999         1.0                        0
221851         2.0                        0
250133        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
389             2.0                         0
82601           1.0                         0
86245           0.0                         0
109081         -1.0                         0
185774         -2.0                         1

        Flowers_open  Flowers_open_incorrect_-2
389              2.0                          0
82601            1.0                          0
86245            0.0                          0
109081          -1.0                          0
185774          -2.0                          1

       Flowers_male  Flowers_male_incorrect_-2
389            -2.0                          0
704             0.0                          2
82601           NaN                          2

       Flowers_Female  Flowers_Female_incorrect_-2
389              -2.0                            0
704               0.0                            2
82601             NaN                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
389               0.0                           0
704               1.0                           0
109081           -1.0                           0
121023            2.0                           0
183273           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
389             0.0                         0
704             1.0                         0
109081         -1.0                         0
130332          2.0                         0
185774         -2.0                         1

       Fruits_open  Fruits_open_incorrect_-2
389           -2.0                         0
704            0.0                         2
82601          NaN                         2

-----------------------------------
Indian tulip tree- Thespesia populnea
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
105898           2.0                          0
107835           1.0                          0
122198           0.0                          0
236548          -2.0                          1
491812          -1.0                          0

        Leaves_mature  Leaves_mature_incorrect_-2
105898            2.0                           0
144478            1.0                           0
149150            0.0                           0
248222           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
105898         NaN                        0
162912         0.0                        0
162913         1.0                        0
162915         2.0                        0
251949        -2.0                        1
270809        -1.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
105898          2.0                         0
117957          0.0                         0
122198          1.0                         0
186893         -2.0                         1
243693         -1.0                         0

        Flowers_open  Flowers_open_incorrect_-2
105898           2.0                          0
107835           0.0                          0
117957           1.0                          0
186893          -2.0                          1
249161          -1.0                          0

        Flowers_male  Flowers_male_incorrect_-2
105898           NaN                          2
162912          -2.0                          0
356958           0.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
105898             NaN                            2
162912            -2.0                            0
356958             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
105898            2.0                           0
117957            0.0                           0
141580            1.0                           0
186893           -2.0                           1
188562           -1.0                           0

        Fruits_ripe  Fruits_ripe_incorrect_-2
105898          0.0                         0
122198          1.0                         0
122653          2.0                         0
188562         -1.0                         0
198235         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
105898          NaN                         2
162912         -2.0                         0
356958          0.0                         2

-----------------------------------
Singapore cherry- Muntingia calabura
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
83644            1.0                          0
83945            2.0                          0
99088            0.0                          0
251187          -2.0                          1
577239          -1.0                          0

        Leaves_mature  Leaves_mature_incorrect_-2
83644             2.0                           0
107549            1.0                           0
107829            0.0                           0
579764           -2.0                           1

        Leaves_old  Leaves_old_incorrect_-2
83644          NaN                        0
178872         1.0                        0
178873         0.0                        0
185178        -2.0                        1
227224         2.0                        0

        Flowers_bud  Flowers_bud_incorrect_-2
83644           0.0                         0
83945           1.0                         0
99091           2.0                         0
193876         -2.0                         1
457046         -1.0                         0

        Flowers_open  Flowers_open_incorrect_-2
83644            1.0                          0
83945            0.0                          0
89144            2.0                          0
196223          -2.0                          1

        Flowers_male  Flowers_male_incorrect_-2
83644            NaN                          2
178872          -2.0                          0
356473           0.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
83644              NaN                            2
178872            -2.0                            0
356473             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
83644             2.0                           0
83945             0.0                           0
89144             1.0                           0
99092            -1.0                           0
188110           -2.0                           1

        Fruits_ripe  Fruits_ripe_incorrect_-2
83644           1.0                         0
83945           0.0                         0
89144           2.0                         0
185178         -2.0                         1
488205         -1.0                         0

        Fruits_open  Fruits_open_incorrect_-2
83644           NaN                         2
178872         -2.0                         0
201455          0.0                         2

-----------------------------------
Siris- Albizia lebbeck
-----------------------------------

        Leaves_fresh  Leaves_fresh_incorrect_-2
20979            0.0                          0
27225            1.0                          0
78346            2.0                          0
187328          -1.0                          0
236213          -2.0                          1

        Leaves_mature  Leaves_mature_incorrect_-2
20979             2.0                           0
22463             0.0                           0
171498            1.0                           0
236213           -2.0                           1
252984           -1.0                           0

        Leaves_old  Leaves_old_incorrect_-2
20979          NaN                        0
180854         1.0                        0
181942         0.0                        0
181953        -1.0                        0
185872         2.0                        0
237115        -2.0                        1

        Flowers_bud  Flowers_bud_incorrect_-2
20979           0.0                         0
27225          -1.0                         0
78346           1.0                         0
185872         -2.0                         1
201118          2.0                         0

        Flowers_open  Flowers_open_incorrect_-2
20979            0.0                          0
27225           -1.0                          0
78346            1.0                          0
185872          -2.0                          1
198806           2.0                          0

        Flowers_male  Flowers_male_incorrect_-2
20979            NaN                          2
180854          -2.0                          0
358297           0.0                          2

        Flowers_Female  Flowers_Female_incorrect_-2
20979              NaN                            2
180854            -2.0                            0
358297             0.0                            2

        Fruits_unripe  Fruits_unripe_incorrect_-2
20979             2.0                           0
22463             0.0                           0
120105            1.0                           0
185334           -2.0                           1
185853           -1.0                           0

        Fruits_ripe  Fruits_ripe_incorrect_-2
20979           1.0                         0
22463           0.0                         0
110129          2.0                         0
187979         -1.0                         0
190106         -2.0                         1

        Fruits_open  Fruits_open_incorrect_-2
20979           NaN                         0
180854         -2.0                         1
201101          0.0                         0

In [7]:
# Checking the total number of incorrect -2 labels over all species.
for col in incorrect_negative_2_df.columns[-10:]:
    print(incorrect_negative_2_df[col].value_counts())

Leaves_fresh_incorrect_-2
0    591217
1      1376
Name: count, dtype: int64
Leaves_mature_incorrect_-2
0    591917
1       676
Name: count, dtype: int64
Leaves_old_incorrect_-2
0    587276
1      5317
Name: count, dtype: int64
Flowers_bud_incorrect_-2
0    563048
1     15252
2     14293
Name: count, dtype: int64
Flowers_open_incorrect_-2
0    488324
2     92747
1     11522
Name: count, dtype: int64
Flowers_male_incorrect_-2
0    371952
2    203701
1     16940
Name: count, dtype: int64
Flowers_Female_incorrect_-2
0    372474
2    203197
1     16922
Name: count, dtype: int64
Fruits_unripe_incorrect_-2
0    575852
1     16741
Name: count, dtype: int64
Fruits_ripe_incorrect_-2
0    576175
1     16418
Name: count, dtype: int64
Fruits_open_incorrect_-2
0    359980
2    225454
1      7159
Name: count, dtype: int64

# Download CSV File

In [8]:
incorrect_negative_2_df.to_csv('alldata_labeling_-2_top_50.csv', index=False)